Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: You can assign your audio file to a specific Audio group.
zh_cn: 你可以将你的音频文件分到一个特定的 Audio group (音频组)。

source: You can change the name of a resource (except the top level ones that show the type of resource contained within) by selecting it once with a single click, and then giving another single click on the name once again.
zh_cn: 你可以通过单击选中然后再次单击的方式更改资源的名字 (除了资源树顶级的资源类型名称)。

source: You can change the order of the resources by clicking on a specific resource and then dragging it to the appropriate place within its resource group.
zh_cn: 你可以选中一个资源然后拖到适当的位置来改变排序。

source: You can change views easily by clicking the drop-down tab on the right and selecting the option you require.
zh_cn: 你能通过在右侧点击下拉选项卡来改变视觉效果，选择你需要的选项。

source: You can check the return value of this function too as a debug tool to check whether the surface target was set or not, with a return value of 0 being a failure to set the target and any other positive value being a success.
zh_cn: 你可以检测这个函数的返回值作为一个调试工具，判断是否成功设置了一个表面层目标，0表示设置目标表面失败，其它的正值都代表成功。

source: You can click any point of a path and then drag the mouse to move it around in the editor, although be aware that the green path start position is not directly selectable as it changes position automatically depending on whether the path is smooth or not (more on this further down).
zh_cn: 你可以点击任何一个路径点然后拖动鼠标来改变这个点的位置，不过要注意的是绿色的路径起点是不能直接在这里改变位置的，它会根据你的路径是否平滑而自动改变它的位置。

source: You can create your own sprites in GameMaker: Studio or load them from files and use them "as is" or edit them yourself with the powerful GameMaker: Studio sprite editor.
zh_cn: 你可以在 GameMaker: Studio 里创建自己的精灵或从文件加载或者自己用强大的 GameMaker: Studio 精灵编辑器制作。

source: You can delete them (clear all of them so that you can create a new watch layout), or save the current layout or load a previously saved layout.
zh_cn: 你可以把它们全删掉（把它们全部清理掉你就能获得一个全新的窗口布局），或者把当前的布局存起来再或者读取以前存储的布局。

source: You can do this using a number of consecutive "if" statements but when the possible choices gets above two or three it is usually easier to use the "switch" statement.
zh_cn: 通常可以使用多个连续的 "if" 语句，但如果选项在两、三个以上时，“switch”语句使用起来更容易。

source: You can either use a customizable block pattern, or a solid fill colour which you can change by clicking on the colour selector box.
zh_cn: 你可以使用自定义的块模式或者通过点击颜色选择框用纯色填充颜色。

source: You can even mix Drag'n'Drop with code!
zh_cn: 此外，GML代码块能与按钮混用！

source: You can find descriptions of all the functions available in GML as well as an overview of how they can be used along with examples of code using them.
zh_cn: 你可以找到所有可用GML函数的描述，以及如何在代码中使用的例子。

source: You can find further information about this from the YoYo Games Knowledge Base as well as on the individual target module Global Game Settings pages detailed in this manual.
zh_cn: 你可以在 YoYo Games 知识库 里找到更多的信息，同时在本手册的个人目标模块 Global Game Settings 页面会作详细描述。

source: You can find out more information about the GameMaker: Player target platform from the YoYo Games Knowledge Base - GameMaker: Player.
zh_cn: 更多关于 GameMaker: Player 平台的信息可以在 YoYo Games 知识库找到。

source: You can find out more information on accessors and how they work, along with an example for arrays, from the following page:
zh_cn: 关于它的用法，访问器这一节可以找到更多的信息和数组的例子，详情访下面的页面：

source: You can get a copy of the SDK here.
zh_cn: 您可以在 here 获得SDK。.

source: You can get the ID for the notification to cancel using the functions push_get_first_local_notification() and push_get_next_local_notification() and the function will return true on success or false otherwise (for example if the notification does not exist or has already been triggered).
zh_cn: 你可以获得所取消的通知的ID通过使用函数 push_get_first_local_notification() 和 push_get_next_local_notification() ，函数将在成功时返回 true 其他情况返回 false （例如通知不存在或者已经被触发）。

source: You can have included files however, and you need not worry about whether your games will work on Mac OS X, Ubuntu (Linux) or Windows as that side of things is handled by Steam.
zh_cn: 你可以包含文件，不需要考虑你的游戏是在 Mac OS X、Ubuntu (Linux) 还是 Windows 上工作，Steam 为你做好了一切。

source: You can import and create images and sounds to use in objects, and then instantly see the results of your actions at the press of a button.
zh_cn: 可以导入或者创建用于物体的图像和声音，然后在按下按钮的时候您就可以立即看到结果。

source: You can of course export a *.gmz file and let them use GameMaker: Studio to play it but this is normally not what you want!
zh_cn: 当然你可以导出 *.gmz 资源文件并且让他们使用 GameMaker: Studio 来玩你的游戏，但是这通常并不是你想要的！

source: You can only use this command when the file has been changed and, again, there is a tool-bar button for this.
zh_cn: 当文件被修改只能使用此按钮，工具栏上也有相同的按钮。

source: You can reset the GUI layer at any time to the default configuration by calling this function using -1 as both the width and height - this will set the (0, 0) position to the application surface and the width and height will be reset to 1:1 with the surface too.
zh_cn: 通过调用这个函数，设置宽和高为-1，你可以在任何时间重置GUI层为默认设置。这个操作将设置GUI层至应用表面左上角的(0,0)坐标，宽和高重置应用表面相同的大小。

source: You can see the memory use, or how the GML is performing on the CPU, or a combination of both.
zh_cn: 你可以查看内存使用，或者GML在CPU中是如何表现的，或者二者结合。

source: You can select any buffer created by setting the Buffer ID value, which will start at 0 for the first buffer created in your game, and increment by 1 for each consecutive buffer.
zh_cn: 你可以选择任一使用缓冲ID的值产生的缓冲器，其中缓冲ID对第一个缓冲器是从0开始的，接下来的缓冲器每一个的ID加1。

source: You can select from textures or surfaces from the top of the watch, and then select the texture or surface ID to have it displayed in the window.
zh_cn: 你可以在视图顶端选择材质还是表面，然后选择材质或表面的ID让它显示在窗口中。

source: You can set the Depth of the instances of an object, which basically controls whether they go below or above other objects at other depths.
zh_cn: 你可以为物体的实例设置 深度，用来控制实例是位于其他实例之上还是之下，

source: You can set the view to follow a specific instance using the view_object variable (or in the room editor) and by setting this value you can control how near or far from the edge of the view the instance needs to be before the view will move.
zh_cn: 你可以使用变量 view_object 设置视野跟随指定的实例 (或者在 房间编辑器中设置)，然后设置这个值控制实例需要移动多远或多近视野才会移动。

source: You can specify a local x and y position to copy from as well as the width and height of the section.
zh_cn: 你可以指定源表面复制区域的局部x和y坐标，以及选区的宽度和高度。

source: You can start the Debug Module by running your game from GameMaker: Studio using the red"Play" button at the top of the IDE, or by going to the Run menu and selecting "Run in Debug Mode".
zh_cn: 你可以在GameMaker: Studio中，点击位于IDE的顶部的红色"Play" 按钮来启动你的游戏以进入调试模块，或者通过点击 Run菜单中的“Run in Debug Mode”来启动。

source: You can then drag this point to get it to the position you wish.
zh_cn: 然后你可以拖动这个新插入的点到你想要的位置上去。

source: You can use code in a number of places within GameMaker: Studio, from objects, to rooms and instances, and there are a number of built in functions that make your life easier when programming, however it is often necessary for you to create your own functions to do a specific task, or to condense a large section of code into a more manageable chunk, or even to be able to re-use a particular code block in many different places.
zh_cn: 在GameMaker: Studio里，无论是对象还是房间和实例，你可以在各种地方使用代码，同时软件提供的大量内建函数可以让你编写游戏更加方便有效，但是在有些时候，创建属于你 自己的函数是非常有用的。无论是用来完成某些特殊的功能，或者只是用来让你的代码看起来更整洁更有条理，又或者你想要在游戏的多个地方执行相同的代码，脚本都是你的不二选择。

source: You can use code within object events to control the behaviour and interactions of instances of those objects.
zh_cn: 在对象事件中加入GML代码，你能够更好的控制这个对象的行为，或者与其他对象的交互。

source: You can use this function to enable or disable the application surface at any time in your game, but you should note that it requires at least one frame (step) for the changes to take effect.
zh_cn: 你可以游戏中的任何时间使用这个函数启用或禁用应用表面层，但应该注意更改生效至少需要一帧（一步）。

source: You can use this function to enable or disable the automatic drawing of the application surface.
zh_cn: 你可以使用这个函数决定允许或者不允许应用表面层的自动绘制。

source: You cannot use MIDI any longer and any imported files from legacy versions which use these may cause the program to crash.
zh_cn: 你不能再使用 MIDI，并且从老版本中导入这些文件可能会导致程序崩溃。

source: You could even set an alarm in the time line so that it is repeated after a certain length of time and in this way your guard can patrol an area!
zh_cn: 你甚至可以在时间轴中操作一个定时事件，这样这个事件就会每隔一定时间执行一次。现在你的守卫就可以在一个区域里巡逻了！

source: You have not successfully logged in to the given Cloud Service
zh_cn: 未能成功登陆到给定的云服务。

source: You must indicate the moment, which is the number of steps since the time line was started.
zh_cn: 你必须指定一个从时间轴开始之后的游戏步数。

source: You must indicate the start of the range, the end of the range, and the new time step to which the start of the range must be shifted.
zh_cn: 你必须指定起始和结束的时刻范围，以及新的范围的起始时刻。

source: You must indicate the time step of the first moment to delete and the last one.
zh_cn: 你必须设定要删除的时刻范围的起始与结束时刻。

source: You must then send this registration id to your server, and every device that your game is installed on will have a different registration id.
zh_cn: 你必须发送这个注册ID（registration id）到你的服务器，每个设备都拥有独一无二的注册ID（registration id）。

source: You must use either argument0...15 or argument[0...15].
zh_cn: 你必须 要么 使用argument0...15 ，要么使用 argument[0...15]。

source: You see, an array is basically a container with a number of spaces to store values, and each position in the container has a specific number to identify it, which is what we put in the [].
zh_cn: 本质上数组就是一个存储许多数值的一个容器，其中的每个数据在这个容器中都有一个对应的编号，我们把这个编号放在两个中括号“[]”中。

source: You should ALWAYS check that a surface exists using surface_exists before referencing them directly.
zh_cn: 在直接引用它们之前，你需要 一直使用 surface_exists检测表面层是否退出。

source: You should also be aware that backgrounds in GameMaker: Studio are designed to tile and this means they have overlapping pixels on either side, so if you see any strange artefacts (transparent lines, extra pixels, etc.) then you should possibly be using sprites instead for the graphical effect you wish to achieve.
zh_cn: 你应该知道 GameMaker: Studio 里的背景是为了磁贴设计的，这意味着它们的两边有重复的像素，所以如果你看到了奇怪的东西 (透明线、额外的像素等等) 尽可能使用精灵替代这些图形效果以达到目的。

source: You should also be aware that the games uploaded to the workshop cannot make use of extensions in any form as Steam consider them to be a security risk.
zh_cn: 你要知道 Steam 考虑的是安全问题。

source: You should also realise that nothing will be seen if the surface itself is not drawn on the screen in the draw event of an instance.
zh_cn: 还需要知道的是，还需要在实例的绘制事件中绘制才可以看到表面层的内容。

source: You should call the function push_get_first_local_notification to get the first notification in the queue and then use this function to continue through it.
zh_cn: 你应该调用函数 push_get_first_local_notification来获得队列中第一个通知，然后再调用本函数来遍历通知队列。

source: You should then select the visibility of your game which can be either:
zh_cn: 然后你需要选择你的游戏的可见度(3选1):

source: You simply set the date and time for the notification and it will be displayed to the user if the game is not currently running.
zh_cn: 你仅仅需要设置时间日期和通知内容，如果你的程序当前没有在运行的话，通知就会被推送。You simply set the date and time for the notification and it will be displayed to the user if the game is not currently running.

source: You specify the start and the end of the range and the percentage for the spread.
zh_cn: 你指定要伸缩的范围的起始和结束时刻，再指定新的范围长度的百分比。

source: You specify the start and the end of the range and they will all be merged into the start moment.
zh_cn: 你需要指定要合并的时刻范围的起始和结束时刻，合并后的动作会位于这个范围的起始时刻上。

source: You will also need a Windows 8 PC with the following specifications:
zh_cn: 您还需要一个具有以下配置的windows 8 电脑。:

source: You will also need to download and install Xcode for your version of the OS (minimum Xcode version 6).
zh_cn: 你还需要下载并安装您的操作系统版本的Xcode (至少 Xcode 版本 6)。.

source: You will also need to download the Android SDK as GameMaker: Studio requires some of the components of the different Android versions and the Platform Tools it installs.
zh_cn: 您还需要下载 GameMaker: Studio 不同版本的 Android SDK 组件和 Platform Tools。

source: You will also need to make sure that you have Microsoft .Net Framework 3.5 installed (.Net 4 is installed as standard with Windows 8, but you may need to install the previous version too) which is available here, although when you install GameMaker: Studio on your Windows 8 OS it should complete this part automatically.
zh_cn: 您还需要确保您安装有 Microsoft .Net Framework 3.5 (.Net 4 内置在Windows 8里，但是您可能也需要之前的版本)，可在 here, 下载，尽管当你在 Windows 8 上安装 GameMaker: Studio 的时候它会自动完成这一部分。

source: You will be warned before the operation is completed and given the option to cancel or go ahead.
zh_cn: 在操作之前会被警告。.

source: You will notice that the array has been initialised backwards, with the last value being defined first.
zh_cn: 你将会注意这个数组是倒序初始化的，最后一个位置是首先定义的。

source: You would then create moment 20 (a "moment" is just another way of saying "step") and set a motion upward, then at moment 30 a motion to the right, at moment 50 a motion downwards and finally at moment 60 you would stop the motion.
zh_cn: 然后在第20步处设置向上运动，接着在30步处设置向右运动，然后再第50步处设置向下运动，最后在第60步时停止运动。

source: You would then set the drawing target to the surface rather than the display and draw the things you wish as well as perform any other manipulations.
zh_cn: 然后你可以设置绘图目标到表面上，而不是显示器，往里面绘制内容并进行一些调整。

source: You would then want to check the returned ds_map in the asynchronous Cloud Event to get the status and the returned string, if there is one, with something like the following code:
zh_cn: 你需要检查从异步 Cloud Event 返回的 ds_map来获得返回的 status 和具体字符串。 你可以通过如下代码来获得：:

source: Your server must maintain a list of ids for registered devices, as when when you send a push notification message from your server, you use the registration ids to send the message to the registered devices.
zh_cn: 你的服务器 必须保存已注册设备的ID列表, 当你从服务器上推送通知消息时.你需要这些注册ID来将消息推送到对应的已注册设备上。

source: a = ((b == c) || d); //best
zh_cn: a = ((b == c) || d); //最好是这样

source: a = (b == c || d); //better
zh_cn: a = (b == c || d); //这样更好

source: additional module for the Professional Version
zh_cn: 只存在于专业版additional module for the Professional Version

source: additional module for uploading to the GameMaker: Player
zh_cn: 上传到 GameMaker: Player 的附加模块

source: array[count] = "are "
zh_cn: array[count] = "are "; // 再赋值

source: array[count] = "you?"
zh_cn: array[count] = "you?"; // 用变量作为数组的下标位置，给数组赋值

source: as the return value for the expression is a real number and so must be enclosed in brackets to be used in this way (see Addressing Variables In Other Instances for more information), so the above code should actually be written as:
zh_cn: 因为返回值是一个实数，这种时候你必须将整个函数用括号包围起来（更多信息请看 访问其它实例的变量）， 所以代码实际上应该这样写：

source: cloud_file_save
zh_cn: cloud_file_save 云端文件保存

source: cloud_string_save
zh_cn: cloud_string_save 云端字符串保存

source: cloud_synchronise
zh_cn: cloud_synchronise 云端同步

source: colour = $FFAA00;
zh_cn: colour = $FFAA00; // 十六进制经常用来还你颜色，具体颜色用在线工具查看，ps当然也可以

source: count -= 1;
zh_cn: count -= 1; // 位置减1

source: count = 3;
zh_cn: count = 3; // 先用变量定义数组的最大位置

source: data from cloud_string_save or cloud_file_save was successfully uploaded to the cloud
zh_cn: 来自 cloud_string_save 或 cloud_file_save的数据被成功的上传到云端。

source: do <statement> until (<expression>)
zh_cn: do <语句> until (<表达式>)

source: draw_text(32, 32, array[3]); //draw an array value
zh_cn: draw_text(32, 32, array[3]); // 绘制数组的值

source: dual-core 2 GHz CPU
zh_cn: 双核 2 GHz CPU

source: enemy[3, 0] = obj_Slime; //Object
zh_cn: enemy[3, 0] = obj_Slime; //物体

source: enemy[3, 1] = 32; //x position
zh_cn: enemy[3, 1] = 32; //x 坐标

source: enemy[3, 2] = 448; //y position
zh_cn: enemy[3, 2] = 448; // y 坐标

source: flag
zh_cn: 标识

source: for (<statement1> ; <expression> ;<statement2>) <statement3>
zh_cn: for (<statement1> ; <表达式> ;<statement2>) <statement3>

source: for (var i = 0; i < 10; i++;) {do something...};
zh_cn: for (var i = 0; i < 10; i++;) {做些什么...};

source: full
zh_cn: 全屏

source: here is an example of a typical "switch" from a game:
zh_cn: 下面是游戏中的“switch”典型用法：

source: i = irandom(3); //get a random number from 0 to 4
zh_cn: i = irandom(3); // 获取0-4的随机整数

source: iPad 1 and above
zh_cn: iPad 1 以及更高

source: iPhone 4, 4S, 5, 5C, 5S, 6, and 6plus
zh_cn: iPhone 4、4S、5、5C、5S、6 和 6plus

source: iPod Touch 3rd Gen and above
zh_cn: iPod Touch 3rd Gen 以及更高

source: if !is_real(argument0)
zh_cn: if !is_real(argument0) // 如果不是实数

source: if (<expression>) <statement>
zh_cn: if (<表达式>) <语句>

source: if (<expression>) <statement> else <statement>
zh_cn: if (<表达式>) <语句1> else <语句2>

source: if (<expression>)
zh_cn: if (<表达式>)

source: if (a != b) {do something...}
zh_cn: if (a != b) {做些什么...}

source: if (a < b) {do something...}
zh_cn: if (a < b) {做些什么...}

source: if (a == b && c == d) {do something...}// and
zh_cn: if (a == b && c == d) {do something...} // 与

source: if (a == b ^^ c == d) {do something...} // xor
zh_cn: if (a == b ^^ c == d) {do something...} // 异或

source: if (a == b || c ==d) {do something...}// or
zh_cn: if (a == b || c ==d) {do something...} // 或

source: if (array[9]) == 10 //Check an array value
zh_cn: if (array[9]) == 10 // 检测数组的值

source: if (y ^ $1f) > 0 {do something...};
zh_cn: if (y ^ $1f) > 0 {做些什么...}; //

source: if keyboard_check_pressed(vk_enter)
zh_cn: if keyboard_check_pressed(vk_enter) // 检测回车键

source: if the status is a negative number, something has gone wrong and the user is informed, otherwise the code will continue and retrieve the synchronised data and write it to a text file for later use.
zh_cn: 如果 status 是一个负数, 则告知用户这里出现了错误, 否则，代码将继续获取同步的数据并将它写入一个文本文件供以后使用。

source: if you are also using the YoYo Compiler (YYC) then you will also need to install a copy of the Android NDK which can be found here.
zh_cn: 如果您使用 YoYo Compiler (YYC) 您将需要 Android NDK ，可以在 here 获取。

source: if you do not have a Windows Phone device, you can make use of the Windows Phone emulator, however be aware that these additional requirements will also apply in that case:
zh_cn: 如果您没有 Windows Phone 设备，您可以使用 Windows Phone 模拟器，但是注意这需要额外的需求:

source: in fact, the uses for surfaces are endless!
zh_cn: 事实上，表面的用途是无穷的！

source: included in all versions
zh_cn: 包含在所有版本中

source: included in all versions of GameMaker: Studio bought through Steam
zh_cn: 包含在 steam 购买的 GameMaker: Studio 的所有版本中

source: instance_create(enemy[i, 1], enemy[i, 2], enemy[i, 0]); //Use the array to create the object
zh_cn: instance_create(enemy[i, 1], enemy[i, 2], enemy[i, 0]); // 使用数组创建物体的实例

source: or as this:
zh_cn: 或者这样：

source: or it can have the slightly more complex "if... else..." form:
zh_cn: 或者它也可以有略微复杂的"if... else..."形式：

source: repeat (<expression>) <statement>
zh_cn: repeat (<表达式>) <语句>

source: return <expression>
zh_cn: return <表达式>

source: str = 'hello world';
zh_cn: str = 'hello world'; // 世界：“你好，程序员，单引号，双引号里面的东西我都能识别。”

source: switch (<expression>)
zh_cn: switch (<表达式>)

source: the above code will check the variable "shake" and if it returns true, it will then change the view[0] angle to a random value between -10 and 10 every step until the variable returns false, at which time it will return the view[0] angle to 0º.
zh_cn: 上述代码将检测变量“shake”，如果返回true，它将每步改变视野view[0] 角度为-10 至 10 之间的随机值，直到那个“shake”返回 false，此时 view[0] 角度将返回为 0º。

source: the area copied corresponds to a rectangle formed by the relative position of the mouse within the surface as it would be drawn in view[1].
zh_cn: 被复制的区域相当于一个矩形，截取自表面内相对鼠标的位置，它将在view[1]里绘制。

source: the following code example illustrates a typical use for this type of statement:
zh_cn: 下面的代码解释这种语句的典型用法：

source: these points can then be moved by clicking and dragging on them (as can all points on the path), or by changing the values presented to you on the left for the X and Y position.
zh_cn: 随后你可以通过点击这个点并且拖动它来移动这个路径点（你也可以对路径上的其它点这么做），或者你可以修改左侧标有 X 和 Y 的输入框的值来改变点的位置。

source: this can be very useful when it comes to optimising the way your game runs and the amount of texture swaps that must be done while the game is being played.
zh_cn: 这对于你优化你的游戏的运行方式和游戏运行时的纹理交换量十分有帮助。

source: this cannot be updated in real time so you will need to pause the game to get and update the frame details.
zh_cn: 这些信息不会实时更新，所以你需要暂停游戏来获得帧细节的更新。

source: to avoid this, use the () to separate out the parts, like this:
zh_cn: 为避免这种情况，使用“()”括号隔开不同的部分，像这样：

source: total = array[0] + array[5]; //Add two array values together
zh_cn: total = array[0] + array[5]; // 两个数组中的值相加

source: vbm_fast
zh_cn: vbm_fastvbm_fast

source: while (<expression>) <statement>
zh_cn: while (<表达式>) <语句>

source: will give different results depending on the platform.
zh_cn: 根据平台不同可能会得出不同的结果。

source: x *= y;
zh_cn: x *= y; // x腥等鱼歪，等同于 x = x * y;

source: x = (x & $ffffffe0) + 32;
zh_cn: x = (x & $ffffffe0) + 32; // 括号中的运算会将变量偏移为32、64、128等2的倍数，详见 http://wiki.gamemake.org/index.php?doc-view-6

source: x = 23;
zh_cn: x = 23; // x 将勇敢的等于23，不是233

source: x = y << 2;
zh_cn: x = y << 2; // 比如y = 100; 二进制数是 “1100100”，左移两位是“110010000”，转成十进制是400。每左移一位多乘一次2。

source: y += 5;
zh_cn: y += 5; // 等同于 y = y + 5; 等同于将“ y ++”执行五次。

source: you can also set a speed for individual path points by changing the value in the Sp box (default value is 100).
zh_cn: 通过改变 Sp 输入框里的值，你可以给这个点设置一个速度（默认值是100）。

source: Rooms
zh_cn: 房间

source: Including files
zh_cn: 包含文件

source: GameMaker Studio Overview
zh_cn: GameMaker Studio 概述

source: Time lines
zh_cn: 时间轴

source: Exporting and importing resources
zh_cn: 导出和导入资源

source: Macros
zh_cn: 宏

source: The Debug Module
zh_cn: 调试模块

source: Extensions
zh_cn: 扩展

source: Global game settings
zh_cn: 全局游戏设定

source: Sounds and music
zh_cn: 声音和音乐

source: Defining objects
zh_cn: 定义物体

source: More about backgrounds
zh_cn: 更多关于背景

source: More about objects
zh_cn: 更多关于物体

source: Distributing your game
zh_cn: 发布你的游戏

source: More about rooms
zh_cn: 更多关于房间

source: More about sprites
zh_cn: 更多关于精灵图

source: Preferences
zh_cn: 首选项

source: GML Language Overview
zh_cn: GML 概述

source: Drop Down Menus
zh_cn: 下拉菜单

source: Step Event
zh_cn: 步事件

source: Trigger Event
zh_cn: 触发器事件

source: Backgrounds Tab
zh_cn: 背景选项卡

source: Objects Tab
zh_cn: 物体选项卡

source: Settings Tab
zh_cn: 设置选项卡

source: Android Extensions
zh_cn: 安卓扩展

source: Creating Extensions
zh_cn: 创建扩展

source: iOS Extensions
zh_cn: iOS 扩展

source: Legacy Extensions
zh_cn: 传统扩展

source: Proxy Files
zh_cn: 代理文件

source: Using Extensions
zh_cn: 使用扩展

source: Advertising Tab
zh_cn: 广告选项卡

source: Analytics Tab
zh_cn: 分析选项卡

source: Android Tab
zh_cn: 安卓选项卡

source: Audio Groups Tab
zh_cn: 音频组选项卡

source: Extras Tab
zh_cn: 附加选项卡

source: Facebook Tab
zh_cn: Facebook 选项卡

source: General Tab
zh_cn: 常规选项卡

source: HTML5 Tab
zh_cn: HTML5 选项卡

source: In App Purchases Tab
zh_cn: 应用内购选项卡

source: iOS Tab
zh_cn: iOS 选项卡

source: Licensing Tab
zh_cn: 许可证选项卡

source: Linux Tab
zh_cn: Linux 选项卡

source: Mac OS Tab
zh_cn: Mac OS 选项卡

source: Project Info Tab
zh_cn: 项目信息选项卡

source: Source Control Tab
zh_cn: 源代码控制选项卡

source: Steam Tab
zh_cn: Steam 选项卡

source: Texture Groups Tab
zh_cn: 纹理组选项卡

source: Tizen Tab
zh_cn: Tizen 选项卡

source: Win8 Phone Tab
zh_cn: Win8 Phone 选项卡

source: Win8 Tab
zh_cn: Win8 选项卡

source: Windows Tab
zh_cn: Windows 选项卡

source: Audio Playback
zh_cn: 音频播放

source: Audio Recording
zh_cn: 音频录制

source: Cloud
zh_cn: 云

source: Dialogs
zh_cn: 对话

source: Image Loaded and Sound Loaded Events
zh_cn: 图像加载和声音加载的事件

source: Load And Save
zh_cn: 加载和保存

source: Push
zh_cn: 推送

source: Social
zh_cn: 社会化内容

source: System Event
zh_cn: 系统事件

source: Designing Tiles
zh_cn: 设计图块

source: Texture Pages
zh_cn: 纹理页

source: Tiles
zh_cn: 图块

source: Advanced Tools
zh_cn: 高级工具

source: Drawing Tools
zh_cn: 绘制工具

source: Editing Collision Masks
zh_cn: 编辑碰撞遮罩

source: Editing Subimages
zh_cn: 编辑子图

source: Importing Skeletal Animations
zh_cn: 导入骨骼动画

source: Importing Vector Images
zh_cn: 导入矢量图

source: Animation Menu
zh_cn: 动画菜单

source: Android Preferences
zh_cn: Android 首选项

source: Editor Preferences
zh_cn: Editor 首选项

source: Form Preferences
zh_cn: Form 首选项

source: General Preferences
zh_cn: 常规首选项

source: iOS Preferences
zh_cn: iOS 首选项
